In [172]:
# Dependencies and Setup
import pandas as pd

In [173]:
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

In [174]:
purchase_data_df = pd.read_csv(file_to_load)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [ ]:
# Players Count

In [175]:
unique_df = purchase_data_df["SN"].unique()
lenght_df = len(unique_df)
lenght_df

576

In [176]:
# Finding the value count  of "SN" column 
total_players_df = purchase_data_df["SN"].value_counts()
total_players_df

Lisosia93      5
Iral74         4
Idastidru52    4
Chamimla85     3
Hiaral50       3
              ..
Tyirinu79      1
Syathecal44    1
Aidai61        1
Ryanara76      1
Lisirra58      1
Name: SN, Length: 576, dtype: int64

In [177]:
output_list = [{"Total_Players": len(total_players_df)}]
output1_df = pd.DataFrame(output_list)
output1_df

   Total_Players
0            576

In [178]:
Total_Players = len(total_players_df)
Total_Players

576

In [179]:
pd.crosstab(purchase_data_df["SN"], purchase_data_df["Gender"])

Gender         Female  Male  Other / Non-Disclosed
SN
Adairialis76        0     1                      0
Adastirin33         1     0                      0
Aeda94              0     1                      0
Aela59              0     1                      0
Aelaria33           0     1                      0
...               ...   ...                    ...
Yathecal82          3     0                      0
Yathedeu43          0     2                      0
Yoishirrala98       1     0                      0
Zhisrisu83          0     2                      0
Zontibe81           0     3                      0

[576 rows x 3 columns]

In [17]:
total_count = len(pd.crosstab(purchase_data_df["SN"], purchase_data_df["Gender"]))
total_count

576

In [ ]:
# Gender Demographics

In [18]:
unique_genders = purchase_data_df.groupby(["Gender"])["SN"].nunique()
unique_genders

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [19]:
unique_female_count = unique_genders["Female"]
unique_female_count

81

In [20]:
unique_male_count = unique_genders["Male"]
unique_male_count

484

In [21]:
unique_others_count = unique_genders["Other / Non-Disclosed"]
unique_others_count

11

In [130]:
summary_output3 = [{" ": "Male", "Total Count": unique_male_count, "Percentage of Players": ((unique_male_count / total_count)*100) },
             {" ": "Female", "Total Count": unique_female_count, "Percentage of Players": ((unique_female_count / total_count)*100) },
{" ": "Other / Non-Disclosed", "Total Count": unique_others_count, "Percentage of Players": ((unique_others_count / total_count)*100) }]
output3_df = pd.DataFrame(summary_output3)
output3_df

                          Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [131]:
# Use Map to format all the columns
output3_df["Percentage of Players"] = output3_df["Percentage of Players"].map("{:.2f}%".format)
output3_df

                          Total Count Percentage of Players
0                   Male          484                84.03%
1                 Female           81                14.06%
2  Other / Non-Disclosed           11                 1.91%

In [24]:
count = purchase_data_df["Gender"].value_counts()
count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [ ]:
# Purchasing Analysis(Total)

In [29]:
# The unique method shows every element of the series that appears only once
unique_items = len(purchase_data_df["Item ID"].unique())
unique_items

179

In [30]:
# Create a new dataframe of the of the group of unique items
item_group = purchase_data_df.groupby(["Item ID"])
unique_item = item_group.sum()
unique_item

         Purchase ID  Age  Price
Item ID
0               1149   74   5.12
1               1523   89  11.77
2               2006  143  14.88
3               2087  155  14.94
4               1885  124   8.50
...              ...  ...    ...
178             4960  287  50.76
179             1948  126  26.88
181             1278  109   8.30
182             1327   67  12.09
183             1488   66   3.27

[179 rows x 3 columns]

In [31]:
num_unique_items = len(unique_item)
num_unique_items

179

In [32]:
average = purchase_data_df["Price"].mean()
average

3.0509871794871795

In [33]:
average_price = round(average, 2)
average_price

3.05

In [34]:
num_purchases = len(purchase_data_df["Purchase ID"])
num_purchases

780

In [35]:
total_revenue = (purchase_data_df["Price"]).sum()
total_revenue

2379.77

In [145]:
summary_output = [{"Number of Unique Items": num_unique_items, "Average Price": average, 
                   "Number of Purchases": num_purchases, "Total Revenue": total_revenue }]
output2_df = pd.DataFrame(summary_output)
output2_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [37]:
output2_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [146]:
# Use Map to format all the columns
output2_df["Average Price"] = output2_df["Average Price"].map("${:.2f}".format)
output2_df["Total Revenue"] = output2_df["Total Revenue"].map("${:,}".format)
output2_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [39]:
output2_df.dtypes

Number of Unique Items     int64
Average Price             object
Number of Purchases        int64
Total Revenue             object
dtype: object

In [ ]:
# Purchasing Analysis (Gender)

In [40]:
# Collecting a list of all columns within the DataFrame
purchase_data_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [41]:
#create a new table that takes these
gender_df= purchase_data_df[["Item ID","Gender", "Price"]]
gender_df

     Item ID  Gender  Price
0        108    Male   3.53
1        143    Male   1.56
2         92    Male   4.88
3        100    Male   3.27
4        131    Male   1.44
..       ...     ...    ...
775       60  Female   3.54
776      164    Male   1.63
777       67    Male   3.46
778       92    Male   4.19
779       50    Male   4.60

[780 rows x 3 columns]

In [42]:
lock_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Male", ["Item ID", "Gender", "Price"]]
lock_df

     Item ID Gender  Price
0        108   Male   3.53
1        143   Male   1.56
2         92   Male   4.88
3        100   Male   3.27
4        131   Male   1.44
..       ...    ...    ...
774       92   Male   4.19
776      164   Male   1.63
777       67   Male   3.46
778       92   Male   4.19
779       50   Male   4.60

[652 rows x 3 columns]

In [43]:
lock_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Female", ["Item ID", "Gender", "Price"]]
lock_df

     Item ID  Gender  Price
15        98  Female   2.89
18        82  Female   4.90
38       116  Female   4.18
41         7  Female   1.33
55        84  Female   3.79
..       ...     ...    ...
731       12  Female   1.02
740      127  Female   3.92
754       79  Female   4.05
767       92  Female   4.88
775       60  Female   3.54

[113 rows x 3 columns]

In [44]:
lock_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Other / Non-Disclosed", ["Item ID", "Gender", "Price"]]
lock_df

     Item ID                 Gender  Price
9        136  Other / Non-Disclosed   3.58
22        24  Other / Non-Disclosed   3.81
82       160  Other / Non-Disclosed   4.40
111       41  Other / Non-Disclosed   4.75
228       80  Other / Non-Disclosed   3.39
237       16  Other / Non-Disclosed   3.55
242       39  Other / Non-Disclosed   3.94
291       35  Other / Non-Disclosed   3.45
350       34  Other / Non-Disclosed   2.22
401       46  Other / Non-Disclosed   1.33
484       39  Other / Non-Disclosed   3.94
549      146  Other / Non-Disclosed   3.10
629      107  Other / Non-Disclosed   2.18
637      163  Other / Non-Disclosed   3.45
747      146  Other / Non-Disclosed   3.10

In [45]:
avg_total_purchase = lock_df.groupby(["Gender"])
price_df= avg_total_purchase.sum()
price_df

                       Item ID  Price
Gender
Other / Non-Disclosed     1212  50.19

In [46]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [159]:
purchase = gender_df.groupby(["Gender"])
price_df1= purchase.count()
price_df1

                       Item ID  Price
Gender
Female                     113    113
Male                       652    652
Other / Non-Disclosed       15     15

In [161]:
# Reading the cell values
purchase_count_female = price_df1.iloc[0, -1]
purchase_count_female

113

In [162]:
purchase_count_male = price_df1.iloc[1, -1]
purchase_count_male

652

In [164]:
purchase_count_others = price_df1.iloc[2, -1]
purchase_count_others

15

In [107]:
total_purchase = gender_df.groupby(["Gender"])
price_df1= total_purchase.sum()
price_df1

                       Item ID    Price
Gender
Female                    9659   361.94
Male                     60698  1967.64
Other / Non-Disclosed     1212    50.19

In [108]:
# Reading the cell values
total_purchase_female = price_df1.iloc[0, -1]
total_purchase_female

361.93999999999966

In [109]:
total_purchase_male = price_df1.iloc[1, -1]
total_purchase_male

1967.6399999999994

In [110]:
total_purchase_others = price_df1.iloc[2, -1]
total_purchase_others

50.190000000000005

In [55]:
avg_purchase = gender_df.groupby(["Gender"])
price_df2= avg_purchase.mean()
price_df2

                         Item ID     Price
Gender
Female                 85.477876  3.203009
Male                   93.095092  3.017853
Other / Non-Disclosed  80.800000  3.346000

In [121]:
Avg_purchase_price_female = price_df2.iloc[0, -1]
Avg_purchase_price_female

3.203008849557519

In [122]:
Avg_purchase_price_male = price_df2.iloc[1, -1]
Avg_purchase_price_male

3.0178527607361953

In [123]:
Avg_purchase_price_others = price_df2.iloc[2, -1]
Avg_purchase_price_others

3.3460000000000005

In [99]:
unique_female_count = unique_genders["Female"]
unique_female_count

81

In [61]:
unique_male_count = unique_genders["Male"] 
unique_male_count

484

In [63]:
unique_others_count = unique_genders["Other / Non-Disclosed"]
unique_others_count

11

In [167]:
summary_output4 = [{" ": "Female", "Purchase Count": purchase_count_female, "Average Purchase Price": Avg_purchase_price_female, "Total Purchase Value": total_purchase_female, "Avg Total Puchase per Person": (total_purchase_female / unique_female_count)},
             {" ": "Male", "Purchase Count": purchase_count_male, "Average Purchase Price": Avg_purchase_price_male, "Total Purchase Value": total_purchase_male, "Avg Total Puchase per Person": (total_purchase_male / unique_male_count)},
{" ": "Other / Non-Disclosed", "Purchase Count": purchase_count_others, "Average Purchase Price": Avg_purchase_price_others, "Total Purchase Value": total_purchase_others, "Avg Total Puchase per Person": (total_purchase_others / unique_others_count)}]
output4_df = pd.DataFrame(summary_output4)
output4_df

,,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Puchase per Person
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [168]:
# Use Map to format all the columns
output4_df["Average Purchase Price"] = output4_df["Average Purchase Price"].map("${:.2f}".format)
output4_df["Total Purchase Value"] = output4_df["Total Purchase Value"].map("${:,.2f}".format)
output4_df["Avg Total Puchase per Person"] = output4_df["Avg Total Puchase per Person"].map("${:.2f}".format)
output4_df

,,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Puchase per Person
0,Female,113,$3.20,$361.94,$4.47
1,Male,652,$3.02,"$1,967.64",$4.07
2,Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [ ]:
# Age Demographics

In [66]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [67]:
df = purchase_data_df["Age"].max()
df

45

In [68]:
df = purchase_data_df["Age"].min()
df

7

In [69]:
# sorting this dataframe by age
purchase_data_df.sort_values(("Age"), ascending=True)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
33,33,Haillyrgue51,7,Male,44,Bonecarvin Battle Axe,2.38
778,778,Sisur91,7,Male,92,Final Critic,4.19
446,446,Chanossast57,7,Female,119,"Stormbringer, Dark Blade of Ending Misery",4.32
515,515,Haillyrgue51,7,Male,40,Second Chance,2.52
658,658,Quilassa66,7,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23
...,...,...,...,...,...,...,...
557,557,Frichaya88,42,Male,8,"Purgatory, Gem of Regret",3.93
674,674,Aeral68,43,Male,77,"Piety, Guardian of Riddles",4.00
248,248,Isursuir31,44,Male,137,"Aetherius, Boon of the Blessed",3.39
728,728,Chanosiaya39,44,Male,93,Apocalyptic Battlescythe,1.97
761,761,Assim27,45,Male,17,"Lazarus, Terror of the Earth",1.70

In [181]:
# Create the bins in which Data will be held
bins = [7, 9, 14, 19, 24, 29, 34, 39, 45]

In [182]:
# Create the names for the five bins
bin_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39","40+"]
bin_names

['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [183]:
bins_df= pd.cut(purchase_data_df["Age"], bins, labels = bin_names, include_lowest=True)

In [184]:
lock_df = purchase_data_df.loc[purchase_data_df["Age"] < 10, ["Age", "SN", "Price"]]
lock_df

     Age             SN  Price
27     7        Eusri44   3.09
33     7   Haillyrgue51   2.38
37     8      Seuthep89   2.05
78     7   Haillyrgue51   4.60
81     8       Heudai45   3.47
187    8     Tyeurith29   3.65
272    8   Anallorgue57   4.09
311    8   Anallorgue57   1.61
339    8        Ilmol66   1.29
446    7   Chanossast57   4.32
481    7     Sondossa69   4.48
486    9   Eurithphos97   2.05
515    7   Haillyrgue51   2.52
546    9     Sondadar26   3.08
575    9     Sondadar26   3.39
610    7  Frichossala54   3.08
658    7     Quilassa66   4.23
672    9      Ililsan66   2.85
686    8     Chadjask77   4.93
692    9    Quaecjask96   4.40
732    9   Eurithphos97   2.50
767    8        Ilmol66   4.88
778    7        Sisur91   4.19

In [185]:
players_count = lock_df["SN"].unique()
players_count = len(players_count)
players_count

17

In [186]:
count = lock_df["SN"].count()
count

23

In [187]:
total_price = lock_df["Price"].sum()
total_price

77.13

In [188]:
avg_price = lock_df["Price"].mean()
avg_price

3.353478260869565

In [189]:
summary = lock_df["Price"].describe()
summary

count    23.000000
mean      3.353478
std       1.072811
min       1.290000
25%       2.510000
50%       3.390000
75%       4.275000
max       4.930000
Name: Price, dtype: float64

In [190]:
total_count = 576      # as calculated above
percentage_of_players = (players_count / total_count) * 100
percentage_of_players

2.951388888888889